In [40]:
import pandas as pd

In [41]:
df1=pd.read_excel('vlookUp_pandas.xlsx',sheet_name="Table3")

In [42]:
df2=pd.read_excel('vlookUp_pandas.xlsx',sheet_name="Table2")

In [43]:
display(df1)

            Name Team
0      Tom Brady    A
1     Drew Brees    B
2  Aaron Rodgers    C

In [29]:
display(df2)

            Name  Age
0      Tom Brady   40
1     Drew Brees   39
2  Aaron Rodgers   34

In [45]:
results=pd.merge(df1,df2)

In [33]:
df2['Name']

0        Tom Brady
1       Drew Brees
2    Aaron Rodgers
Name: Name, dtype: object

In [44]:
df1['Name']

0        Tom Brady
1       Drew Brees
2    Aaron Rodgers
Name: Name, dtype: object

In [46]:
results

            Name Team  Age
0      Tom Brady    A   40
1     Drew Brees    B   39
2  Aaron Rodgers    C   34